{
  "title": "เครื่องนับจำนวนตัวอักษร",
  "description": "นับจำนวนตัวอักษรและคำในข้อความได้อย่างแม่นยำ",
  "textareaLabel": "ข้อความสำหรับวิเคราะห์",
  "textareaPlaceholder": "ป้อนข้อความของคุณที่นี่...",
  "charWithSpaces": "จำนวนตัวอักษร (รวมช่องว่าง)",
  "charWithoutSpaces": "จำนวนตัวอักษร (ไม่รวมช่องว่าง)",
  "wordCount": "จำนวนคำ",
  "lineCount": "จำนวนบรรทัด",
  "footer": "การคำนวณทั้งหมดดำเนินการภายในเบราว์เซอร์ และจะไม่ถูกส่งไปยังเซิร์ฟเวอร์ ข้อความที่คุณป้อนจะถูกประมวลผลในเครื่องเท่านั้น จึงสามารถใช้งานได้อย่างปลอดภัย",
  "networkMonitor": "ตัวตรวจสอบเครือข่าย",
  "noNetworkRequests": "ไม่มีคำขอเครือข่าย",
  "download": "ดาวน์โหลด",
  "upload": "อัปโหลด",
  "duration": "ระยะเวลา",
  "size": "ขนาด",
  "noRequests": "ไม่มีคำขอ",
  "downloadTest": "ทดสอบการดาวน์โหลด",
  "uploadTest": "ทดสอบการอัปโหลด",
  "fileDesc_main_tsx": "ไฟล์เริ่มต้นของแอป React (โค้ดหลักสำหรับรันแอป)",
  "fileDesc_App_tsx": "คอมโพเนนต์หลักของแอป (กำหนดโครงสร้างโดยรวมของแอป)",
  "fileDesc_NetworkMonitor_tsx": "คอมโพเนนต์ตรวจสอบเครือข่าย (สร้างบันทึกนี้)",
  "fileDesc_react_js": "ไลบรารี React (สร้างหน้าเว็บแบบไดนามิก)",
  "fileDesc_react_dom_client_js": "React DOM client (การแสดงผลในเบราว์เซอร์)",
  "fileDesc_react_jsx_dev_runtime_js": "React JSX runtime (จัดการไวยากรณ์ของคอมโพเนนต์)",
  "fileDesc_heroui_react_js": "ไลบรารีคอมโพเนนต์ UI (ปุ่ม การ์ด ฯลฯ)",
  "fileDesc_lucide_react_js": "ไลบรารีไอคอน (ลูกศร ไอคอนตั้งค่า ฯลฯ)",
  "fileDesc_i18next_js": "ไลบรารีรองรับหลายภาษา",
  "fileDesc_react_i18next_js": "ไลบรารีการทำให้เป็นสากลสำหรับ React",
  "fileDesc_index_css": "สไตล์ชีตของหน้าเว็บ (สี เลย์เอาต์)",
  "fileDesc_calculator_svg": "ไอคอนรูปเครื่องคิดเลข",
  "fileDesc_en_json": "ไฟล์แปลภาษาอังกฤษ",
  "fileDesc_ko_json": "ไฟล์แปลภาษาเกาหลี",
  "fileDesc_zh_json": "ไฟล์แปลภาษาจีน",
  "fileDesc_ja_json": "ไฟล์แปลภาษาญี่ปุ่น",
  "fileDesc_th_json": "ไฟล์แปลภาษาไทย",
  "fileDesc_i18n_ts": "ไฟล์ตั้งค่าการทำให้เป็นสากล",
  "fileDesc_Controls_tsx": "คอมโพเนนต์ปุ่มควบคุม",
  "fileDesc_Header_tsx": "คอมโพเนนต์ส่วนหัว",
  "fileDesc_StatsCard_tsx": "คอมโพเนนต์การ์ดสถิติ",
  "fileDesc_count_ts": "ยูทิลิตีนับจำนวนตัวอักษร",
  "fileDesc_useDarkMode_ts": "ฟีเจอร์สลับโหมดมืด",
  "fileDesc_useAutoScroll_ts": "ฟีเจอร์เลื่อนอัตโนมัติ",
  "fileDesc_hero_ts": "ไฟล์ตั้งค่า HeroUI",
  "fileDesc_fileDescriptions_ts": "ยูทิลิตีคำอธิบายไฟล์",
  "fileDesc_env_mjs": "ไฟล์ตั้งค่าสภาพแวดล้อม",
  "fileDesc_react_refresh": "รีโหลดอัตโนมัติระหว่างการพัฒนา",
  "fileDesc_client": "การเชื่อมต่อเบราว์เซอร์เริ่มต้น",
  "fileDesc_posts": "การส่งข้อมูลทดสอบ (คำขอ API)",
  "fileDesc_chunk_js": "ไฟล์ JavaScript ที่ถูกแยกอัตโนมัติโดย webpack (เพิ่มประสิทธิภาพด้วยการแบ่งไฟล์)",
  "fileDesc_dist_js": "ไฟล์ที่ปรับแต่งแล้วสำหรับการเผยแพร่",
  "fileDesc_1": "คำขอทดสอบหรือการตอบกลับข้อผิดพลาด (ไม่มีข้อมูล)",
  "fileDesc_index_js": "ไฟล์ JavaScript หลักที่สร้างแล้ว (ปรับแต่งสำหรับโปรดักชัน)",
  "fileDesc_es_js": "ไฟล์บันเดิล ES module (การปรับแต่งโมดูล JavaScript)",
  "fileDesc_features_js": "ไฟล์บันเดิลฟีเจอร์ (โมดูลฟีเจอร์ของไลบรารี)",
  "fileDesc_vite_chunk_js": "ไฟล์ JavaScript ที่ถูกแบ่งโค้ดโดย Vite",
  "fileDesc_cloudflare_analytics": "คำขอวิเคราะห์เว็บของ Cloudflare (ภาพรวมการใช้งาน นับจำนวนผู้เข้าชมเท่านั้น)",
  "fileDesc_cloudflare_rum": "คำขอวัดประสิทธิภาพไซต์ของ Cloudflare (ใช้ปรับปรุงความเร็วการโหลด)",
  "fileDesc_other": "ไฟล์อื่น ๆ",
  "unknownFileToastTitle": "ตรวจพบไฟล์ที่ไม่รู้จัก",
  "unknownFileToastDesc": "พบไฟล์ที่ต้องตรวจสอบด้านความปลอดภัย",
  "footerInfo": {
    "safetyTitle": "เหตุใดเว็บไซต์นี้จึงปลอดภัย?",
    "safetyBody": "เว็บไซต์นี้จะไม่ส่งข้อความที่คุณป้อนไปยังเซิร์ฟเวอร์ใด ๆ\n\nการนับจำนวนตัวอักษรและการวิเคราะห์ทั้งหมดดำเนินการภายในเบราว์เซอร์ของคุณ และข้อความที่คุณป้อนจะไม่ถูกส่งออกหรือจัดเก็บภายนอก\n\nตัวตรวจสอบเครือข่ายที่แสดงอยู่ทางด้านขวาจะแสดงการสื่อสารระหว่างเว็บไซต์นี้กับเบราว์เซอร์ของคุณแบบเรียลไทม์\n\nข้อมูลนี้เป็นข้อมูลเดียวกับที่คุณสามารถดูได้ในแท็บ Network ของเครื่องมือสำหรับนักพัฒนาในเบราว์เซอร์ (เช่น Chrome หรือ Safari)\n\nสคริปต์และไฟล์ทั้งหมดที่เว็บไซต์นี้โหลดจะถูกบันทึกไว้ทั้งในตัวตรวจสอบเครือข่ายและในแท็บ Network ของเบราว์เซอร์\n\nตัวอย่างเช่น เมื่อคุณคลิกปุ่มดาวน์โหลด จะมีคำขอชื่อ \"1\" ปรากฏขึ้น และเมื่อคุณคลิกปุ่มอัปโหลด จะมีคำขอชื่อ \"posts\" ปรากฏในทั้งสองที่\n\nในทางกลับกัน การพิมพ์ข้อความในช่อง “ข้อความสำหรับวิเคราะห์” จะไม่ก่อให้เกิดคำขอเครือข่ายใด ๆ\n\nซึ่งช่วยให้คุณสามารถตรวจสอบได้ด้วยตนเองว่าข้อความที่คุณป้อนไม่ได้ถูกส่งไปยังเซิร์ฟเวอร์\n\n※ มีการสื่อสารเครือข่ายขั้นต่ำที่จำเป็นสำหรับการแสดงผลหน้าเว็บและการวัดประสิทธิภาพ (เช่น RUM) แต่เนื้อหาของข้อความที่คุณป้อนไม่ได้ถูกส่งไปยังเซิร์ฟเวอร์ใด ๆ\n\n※ เว็บไซต์นี้ไม่ใช่เครื่องมือด้านความปลอดภัย และมีไว้สำหรับใช้งานในสภาพแวดล้อมเว็บทั่วไป\n\n※ คำอธิบายนี้อ้างอิงจากพฤติกรรมปัจจุบันของเว็บไซต์ และอาจแตกต่างกันไปตามสภาพแวดล้อมของเบราว์เซอร์",
    "adsTitle": "เหตุใดจึงไม่มีโฆษณา?",
    "adsBody": "เราอยู่ในยุคที่ต้องเขียนข้อความเป็นจำนวนมาก\n\nไม่ว่าจะเป็นที่โรงเรียน ที่ทำงาน หรือในสถานการณ์ที่ต้องใช้งานอย่างเร่งด่วนภายนอก ผมไม่อยากให้โฆษณาที่ดูไม่เหมาะสมหรือไม่จำเป็นมาสร้างความอึดอัดในการใช้งาน\n\nด้วยความที่ผมให้ความสำคัญกับโฆษณาและข้อมูลส่วนบุคคลค่อนข้างมาก จึงรู้สึกว่าจำเป็นต้องมีเว็บไซต์แบบนี้ และตัดสินใจสร้างขึ้นมาเอง\n\nหวังว่าคุณจะสามารถใช้งานได้อย่างสบายใจทุกเมื่อ"
  }
}
